//створення новоі гілки та переключення на неі
// git checkout -b new branch
//переключення на main
//git checkout main

//підтягнути зміни з віддаленого репозиторія (feth + pull origin у Desktop) робиться на гілці main
//git pull origin main

//робимо коміт нашоі робочоі гілки
//git add . (збираємо зміни з усіх робочих файлів)
// git commit -m 'what in commit' (робимо коміт)
//git push origin your_branch (відправляємо свою гілку на віддалений репозиторій, pull request)

// щоб стягнути актуальні зміни з мейн, коли працюємо в своій гілці
// 1/ робимо коміт в своій гілці
// git add .
// git commit -m 'what in commit'
// 2.переходимо на мейн і затягуєм свіжі змінні
// git checkout main
//git pull origin main
// 3. повертаємось на свою гілку і мерджимо зміни з мейн
// git checkout your_branch
// git merge main
//якщо є конфлікти вирішуємо локально, комітемо і ще раз мердж

//Навігація по директоріям:
//pwd - шлях до поточноі директоріі
//ls - список усіх файлів і папок у директоріі
//cd ... - вийти с поточноіпапки на рівень вище
//cd name - перейти в папку name, яка в середині поточноі
//clear - очистити консоль
//mkdir name -створити папку name
//rmdir name - видалити папку name
